rkz/extension/Documents/ВыработкаСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ВыработкаСотрудников</Name>
		</Properties>
	</Document>
</MetaDataObject>

rkz/extension/InformationRegisters/бит_СоставИсполнителейИВремяВыполнения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>бит_СоставИсполнителейИВремяВыполнения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КоличествоФакт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЧасыНорма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КоличествоПлан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЧасыФакт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Смена</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СменноеЗадание</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Бригада</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Бригады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументПроизводства</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Разряд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазрядыКатегорииДолжностей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Начисление</Name>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.Начисления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

rkz/extension/Enums/ВидыБригадныхНарядов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ВидыБригадныхНарядов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Бригадный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Персональный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

rkz/extension/Documents/ВыработкаСотрудников/Ext/ObjectModule.bsl
&ИзменениеИКонтроль("ОбработкаЗаполнения")
Процедура бит_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	ЗаполнитьРеквизитыПоУмолчанию();

	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Или ТипЗнч(ДанныеЗаполнения) = Тип("ВыборкаИзРезультатаЗапроса") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;

	Если ЗначениеЗаполнено(ЭтотОбъект.Подразделение) Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект,
		ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЭтотОбъект.Подразделение, "ИспользоватьКТУ,ИспользоватьТарифныеСтавки,ИспользоватьОтработанноеВремя"));
	КонецЕсли;

	Если ВидНаряда = Перечисления.ВидыБригадныхНарядов.БригадныйПоЗаказу21
		Или ВидНаряда = Перечисления.ВидыБригадныхНарядов.БригадныйБезЗаказа21
		Или ВидНаряда = Перечисления.ВидыБригадныхНарядов.Ремонт Тогда
		Автораспределение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Бригада, "ПрименятьРаспределениеПоКТУ");
	КонецЕсли;

	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда

		Если ДанныеЗаполнения.Свойство("ВключатьВПериодВыполненияРабот") И ДанныеЗаполнения.ВключатьВПериодВыполненияРабот
			И ЗначениеЗаполнено(ДанныеЗаполнения.КонецПериода) Тогда
			Дата = ДанныеЗаполнения.КонецПериода;
		КонецЕсли;

		Если ДанныеЗаполнения.Свойство("ВключатьВПериодВыполненияРабот") И НЕ ДанныеЗаполнения.ВключатьВПериодВыполненияРабот Тогда
			Месяц = НачалоМесяца(ТекущаяДатаСеанса());
		КонецЕсли;

		Если ДанныеЗаполнения.Свойство("ЗаполнитьПоОтбору") Тогда

			Документы.ВыработкаСотрудников.ЗаполнитьВидыРаботПоОстаткам(ЭтотОбъект, ДанныеЗаполнения);

			Если ВидНаряда <> Перечисления.ВидыБригадныхНарядов.Персональный Тогда
				Документы.ВыработкаСотрудников.ЗаполнитьРаботников(ЭтотОбъект);
			КонецЕсли;

		КонецЕсли;

	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Месяц) Тогда
		Месяц = НачалоМесяца(ТекущаяДатаСеанса());
	КонецЕсли;

	ПроверяемаяДата = Дата;
	Если НЕ ЗначениеЗаполнено(ПроверяемаяДата) Тогда
		ПроверяемаяДата = ?(ЗначениеЗаполнено(Месяц), Месяц, ТекущаяДатаСеанса());
	КонецЕсли;

	УчетТрудозатратВРазрезеСотрудников = ПроизводствоСервер.ИспользуетсяУчетТрудозатратВРазрезеСотрудников(ПроверяемаяДата);
	
	
	#Вставка // {{ПервыйБИТ ЛистТребований [ЛТ6.1.4] [ASHolyavko@1cbit.ru] [24.09.2025] +        
	
	ЭтотОбъект.Работники.Очистить();
	
	//Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура")
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ВыборкаИзРезультатаЗапроса") Тогда
		
		Распоряжение = ДанныеЗаполнения.Распоряжение;
		 
		ЭтотОбъект.ИспользоватьОтработанноеВремя = Истина;
		ЭтотОбъект.ИспользоватьТарифныеСтавки = Истина;
		
		//Если Распоряжение.Количество() = 0 Тогда
		
		Если ТипЗнч(Распоряжение) = Тип("ДокументСсылка.ПроизводствоБезЗаказа") Тогда
			ЭтотОбъект.Бригада = Распоряжение.бит_Исполнитель;
		ИначеЕсли ТипЗнч(Распоряжение) = Тип("ДокументСсылка.ПроизводственнаяОперация2_2") Тогда
			ЭтотОбъект.Бригада = Распоряжение.Исполнитель;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ЭтотОбъект.Бригада) Тогда
			ЭтотОбъект.ВидНаряда = Перечисления.ВидыБригадныхНарядов.Бригадный;
		КонецЕсли;
		
		//КонецЕсли;
		
		//МассивРегистраторов = Новый Массив;
		//Для Каждого ЭлМассива Из ДанныеЗаполнения.Распоряжения Цикл 
		//	
		//	Если ТипЗнч(ЭлМассива.Ссылка) = Тип("ДокументСсылка.ПроизводствоБезЗаказа")
		//		ИЛИ ТипЗнч(ЭлМассива.Ссылка) = Тип("ДокументСсылка.ПроизводственнаяОперация2_2") Тогда
		//		
		//		МассивРегистраторов.Добавить(ЭлМассива.Ссылка);
		//		
		//	КонецЕсли;
		//	
		//КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_СоставИсполнителейИВремяВыполнения.Смена КАК Смена,
		|	бит_СоставИсполнителейИВремяВыполнения.ДокументПроизводства КАК ОперацияВыпуска,
		|	бит_СоставИсполнителейИВремяВыполнения.Сотрудник КАК Сотрудник,
		|	СУММА(бит_СоставИсполнителейИВремяВыполнения.ЧасыНорма) КАК ЧасыНорма,
		|	СУММА(бит_СоставИсполнителейИВремяВыполнения.ЧасыФакт) КАК ЧасыФакт
		|ПОМЕСТИТЬ вт_Сотрудники
		|ИЗ
		|	РегистрСведений.бит_СоставИсполнителейИВремяВыполнения КАК бит_СоставИсполнителейИВремяВыполнения
		|ГДЕ
		|	бит_СоставИсполнителейИВремяВыполнения.ДокументПроизводства = &Распоряжение
		|
		|СГРУППИРОВАТЬ ПО
		|	бит_СоставИсполнителейИВремяВыполнения.Смена,
		|	бит_СоставИсполнителейИВремяВыполнения.ДокументПроизводства,
		|	бит_СоставИсполнителейИВремяВыполнения.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_Сотрудники.Смена КАК Смена,
		|	вт_Сотрудники.ОперацияВыпуска КАК ОперацияВыпуска,
		|	вт_Сотрудники.Сотрудник КАК Сотрудник,
		|	вт_Сотрудники.ЧасыНорма КАК ЧасыНорма,
		|	вт_Сотрудники.ЧасыФакт КАК ЧасыФакт,
		|	ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудниковСрезПоследних.Значение КАК Значение
		|ИЗ
		|	вт_Сотрудники КАК вт_Сотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудников.СрезПоследних(
		|				&Дата,
		|				Сотрудник В
		|						(ВЫБРАТЬ
		|							вт_Сотрудники.Сотрудник КАК Сотрудник
		|						ИЗ
		|							вт_Сотрудники КАК вт_Сотрудники)
		|					И Показатель = &Показатель) КАК ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудниковСрезПоследних
		|		ПО вт_Сотрудники.Сотрудник = ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудниковСрезПоследних.Сотрудник";
		
		
		Запрос.УстановитьПараметр("Распоряжение", Распоряжение);
		Запрос.УстановитьПараметр("Показатель", Справочники.ПоказателиРасчетаЗарплаты.ТарифнаяСтавкаЧасовая);
		Запрос.УстановитьПараметр("Дата", ЭтотОбъект.Дата);
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НоваяСтрока = ЭтотОбъект.Работники.Добавить();
			НоваяСтрока.Работник = ВыборкаДетальныеЗаписи.Сотрудник.ФизическоеЛицо;
			НоваяСтрока.ТарифнаяСтавка = ВыборкаДетальныеЗаписи.Значение;			
			НоваяСтрока.ОтработаноЧасов = ВыборкаДетальныеЗаписи.ЧасыФакт;
			НоваяСтрока.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
			НоваяСтрока.КТУ = 1;
		КонецЦикла;
		
		//Документы.ВыработкаСотрудников.РаспределитьСуммуПоУчастникам(ЭтотОбъект);
		//СуммаРаспределена = Объект.ВидыРабот.Итог("Сумма") = Объект.Работники.Итог("Сумма");
		
		
	КонецЕсли;
	#КонецВставки // }}ПервыйБИТ ЛистТребований [ЛТ6.1.4] [ASHolyavko@1cbit.ru] [24.09.2025] -
	
	
КонецПроцедуры
